<a href="https://colab.research.google.com/github/shekharkhandelwal1983/DS_ML_Model/blob/master/DS_ML_Model.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
! pip install pyforest

Collecting pyforest
  Downloading https://files.pythonhosted.org/packages/07/b7/c78623e4b215b0476f96038cfe75920eda1a9a216fed1e6105a7d9de5e47/pyforest-0.1.4.tar.gz
Building wheels for collected packages: pyforest
  Building wheel for pyforest (setup.py) ... done
  Created wheel for pyforest: filename=pyforest-0.1.4-py2.py3-none-any.whl size=9606 sha256=699d38be46072516706f7ecffcace7877cc151c5d6e323aeb05a9fa8dfacc186
  Stored in directory: /root/.cache/pip/wheels/b5/6f/28/9dd3fc38ca88e9c30712fc6c61aa83dca4dc496c82136c38f2
Successfully built pyforest
Installing collected packages: pyforest
Successfully installed pyforest-0.1.4

In [0]:
from pyforest import *

In [0]:
from google.colab import files

In [12]:
uploaded = files.upload()

Saving heart.csv to heart.csv

In [0]:
df=pd.read_csv("heart.csv")

In [14]:
df.head()

   age  sex  pain type  ...  thal  heart disease  Unnamed: 14
0   70    1          4  ...     3              2          NaN
1   67    0          3  ...     7              1          NaN
2   57    1          2  ...     7              2          NaN
3   64    1          4  ...     7              1          NaN
4   74    0          2  ...     3              1          NaN

[5 rows x 15 columns]

Titanic Case study

In [0]:
df = pd.read_csv("https://query.data.world/s/gb5wjsz5c76sgfyeas22h4loq7syqt")

In [16]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [17]:
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [25]:
(df.isnull().sum()/df.shape[0])*100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [26]:
df.Fare.value_counts()

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
8.4583      1
9.8375      1
8.3625      1
14.1083     1
17.4000     1
Name: Fare, Length: 248, dtype: int64

In [27]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [28]:
df["Fare"].quantile(.75)

31.0

In [29]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [0]:
df_new=df[df["Sex"]=="female"]

In [35]:
df_new.Survived.value_counts()

1    233
0     81
Name: Survived, dtype: int64

In [36]:
233/891

0.2615039281705948

In [37]:
pd.crosstab(df.Survived, df.Sex)

Sex       female  male
Survived
0             81   468
1            233   109

In [38]:
pd.crosstab(df.Survived, df.Sex, normalize=True)

Sex         female      male
Survived
0         0.090909  0.525253
1         0.261504  0.122334

In [39]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [0]:
df["Age_group"]=pd.cut(df.Age, bins=[0,16,32, 48, 64, 200], labels=[0,1,2,3,4])

In [47]:
sns.countplot("Age_group", hue="Survived", data=df)

In [0]:
#missing value imputer

In [49]:
df.head(1)

   PassengerId  Survived  Pclass  ... Cabin Embarked  Age_group
0            1         0       3  ...   NaN        S          1

[1 rows x 13 columns]

In [0]:
# drop columns that are not needed for modelling
df.drop(["Age_group","PassengerId","Ticket"], axis=1, inplace=True)

In [52]:
df.head(1)

   Survived  Pclass                     Name   Sex  ...  Parch  Fare  Cabin  Embarked
0         0       3  Braund, Mr. Owen Harris  male  ...      0  7.25    NaN         S

[1 rows x 10 columns]

In [0]:
df.drop("Name", inplace=True, axis=1)

In [54]:
df.head(1)

   Survived  Pclass   Sex   Age  SibSp  Parch  Fare Cabin Embarked
0         0       3  male  22.0      1      0  7.25   NaN        S

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Cabin       204 non-null object
Embarked    889 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [56]:
100*(df.isnull().sum()/df.shape[0])

Survived     0.000000
Pclass       0.000000
Sex          0.000000
Age         19.865320
SibSp        0.000000
Parch        0.000000
Fare         0.000000
Cabin       77.104377
Embarked     0.224467
dtype: float64

In [57]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [0]:
# Imputing embarked with S as it is present max times - mode imputation

In [0]:
df["Embarked"]=df["Embarked"].fillna("S")

In [60]:
100*(df.isnull().sum()/df.shape[0])

Survived     0.000000
Pclass       0.000000
Sex          0.000000
Age         19.865320
SibSp        0.000000
Parch        0.000000
Fare         0.000000
Cabin       77.104377
Embarked     0.000000
dtype: float64

In [61]:
df.head(20)

    Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0          0       3    male  22.0      1      0   7.2500   NaN        S
1          1       1  female  38.0      1      0  71.2833   C85        C
2          1       3  female  26.0      0      0   7.9250   NaN        S
3          1       1  female  35.0      1      0  53.1000  C123        S
4          0       3    male  35.0      0      0   8.0500   NaN        S
5          0       3    male   NaN      0      0   8.4583   NaN        Q
6          0       1    male  54.0      0      0  51.8625   E46        S
7          0       3    male   2.0      3      1  21.0750   NaN        S
8          1       3  female  27.0      0      2  11.1333   NaN        S
9          1       2  female  14.0      1      0  30.0708   NaN        C
10         1       3  female   4.0      1      1  16.7000    G6        S
11         1       1  female  58.0      0      0  26.5500  C103        S
12         0       3    male  20.0      0      0   8.0500   NaN        S
13         0       3    male  39.0      1      5  31.2750   NaN        S
14         0       3  female  14.0      0      0   7.8542   NaN        S
15         1       2  female  55.0      0      0  16.0000   NaN        S
16         0       3    male   2.0      4      1  29.1250   NaN        Q
17         1       2    male   NaN      0      0  13.0000   NaN        S
18         0       3  female  31.0      1      0  18.0000   NaN        S
19         1       3  female   NaN      0      0   7.2250   NaN        C

In [62]:
df.Cabin.value_counts()

G6             4
C23 C25 C27    4
B96 B98        4
D              3
C22 C26        3
              ..
C62 C64        1
B30            1
E50            1
B37            1
E46            1
Name: Cabin, Length: 147, dtype: int64

In [0]:
df.drop("Cabin", axis=1, inplace=True)

In [64]:
df.head(1)

   Survived  Pclass   Sex   Age  SibSp  Parch  Fare Embarked
0         0       3  male  22.0      1      0  7.25        S

In [0]:
# use iterative imputer to impute age
# needs all the column in numerical format

In [0]:
#using replace method
df["Sex"].replace(["female","male"],[0,1], inplace=True)

In [66]:
df.head(1)

   Survived  Pclass  Sex   Age  SibSp  Parch  Fare Embarked
0         0       3    1  22.0      1      0  7.25        S

In [0]:
#using Label encoder
from sklearn import preprocessing
le=preprocessing.LabelEncoder()

In [0]:
df["Embarked"]=le.fit_transform(df["Embarked"])

In [69]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2